<?php

defined('SYSPATH') or die('No direct script access.');
return array(
    'integraltype'=>array(1 => '充值',2 => '赠送',3 => '解冻',11 => '结算',12 => '冻结',13 => '充值计调',14 => '管理员清除' ,21 => '评价',22 => '地接充值',23 => '取消兑换',24 => '平台赠送',25 => '登录赠送',26 => '保险冻结',27 => '保险',31 => '兑换',32 => '管理员清除',33 => '平台赠送积分冻结',80 =>'代金充值',81=>' 预订线路消耗代金'),//积分类型
    'refundtype'=>array(0=>'退款',1=>'退款中',2=>'退款中',3=>'退款中',4=>'卖家拒绝',5=>'已退款',6=>'退款中',7=>'申诉中',8=>'退款中',9 => '已退款',10=>'退款失败'),//退款状态 买家申请退款1 买家修改金额2 买家同意退款时为3 卖家拒绝为4 卖家已退款为5 卖家同意退款6 买家申诉7 卖家修改金额8
    'pagesize' => array(0 => '10', 1 => '20', 2 => '30', 3 => '50', 4 => '100'),
    'sexarr' => array('无', '男', '女'),
    'typearr' => array('成人', '儿童', '婴儿'),
    'fangarr' => array('否', '是'),
    'cardcategory' => array(
        '1' => '身份证',
        '2' => '护照',
        '3' => '港澳通行证',
        '4' => '军官证',
        '5' => '其他',
    ),
	'linequery' =>array(
        'linegrade' => array('-1' =>'不限',0 => '跟团游',1 => '自由行', 2 => '自驾游',3 => '邮轮'),
        'lineday' => array(0 =>'不限', 1 => '1天', 2 => '2天', 3 => '3天', 4 => '4天', 5 => '5天', 6 => '6天', 7 => '7天', 8 => '8天', 9 => '9天', 10 => '10天及10天以上'),
        'lineauditstate' => array(0 =>'不限',1 =>'通过', 2 => '待审核', 3 => '拒绝', 4 => '未提交'),
        'linestate' => array(0 =>'正常', 1 => '停止', 2 => '客满', 3 => '截止'),
        'lineprice' => array(0 =>'不限',1 => '500以下',2 => '500-1000',3 => '1000-2000', 4 => '2000-4000', 5 => '4000-6000', 6 => '6000以上'),
        'lineprice2' => array(0 =>array(0=>'',1=>''),1 =>array(0=>0,1=>500),2 => array(0=>500,1=>1000),3 => array(0=>1000,1=>2000), 4 => array(0=>2000,1=>4000), 5 => array(0=>4000,1=>6000), 6 => array(0=>6000,1=>'')),
        'linetraffictool' => array(0 =>'不限', 9=>'待定', 1 =>'飞机', 2 => '火车', 3 => '高铁', 4 => '动车', 5 => '巴士', 6 => '飞机+火车', 7 => '飞机+巴士', 8 => '邮轮'),
        'localtraffic' =>array(0 => '火车往返', 1 =>'汽车往返', 2=>'飞机往返',5=>'船往返',6=>'汽车+船往返', 3=>'火车+汽车往返', 4=>'飞机+汽车往返'),
        'linehdong' => array(0 =>'不限',1 =>'含积分', 2 => '无积分', 3 => '含红包', 4 => '无红包'),    
        'linetake' => array(1 =>'可选接送',2=> '不含接送'),   
        'linetype' => array(0 => 'New', 1=>'热销', 2 => '推荐', 3 => '特价', 4 => '豪华', 5 => '纯玩', 6 => '预约', 15 => '品质'),
        'linedays'=>array(0 => '不限', 1 => '1天', 2 => '2天',3 => '3天', 4 => '4天', 5 => '5天', 6 => '6天', 7 => '7天', 8 => '8天', 9 => '9天', 10 => '10天以上'),
        'linegocity'=>array( 1 => '上海', 2 => '杭州',3 => '苏州', 4 => '北京'),
        'lineappraise'=> array(0 => '不满意', 1 => '一般', 2=>'满意'),//线路评价
        'appraise'=> array(0 => '不满意', 1 => '不满意', 2 => '一般', 3 => '满意',4 => '满意',5 => '满意'),//评价值0，1为不满意，2为一般，3及3以上为满意
        'linecategory'=> array(0 => '周边游', 1 =>'国内游',2 =>'国际线'),//线路类型
        'stagepay'=>array(20=>'20',30=>'30',60=>'60'),
    ),
    'couponstart'=>array(0=>'支付赠送',1=>'注册赠送',2=>'平台赠送',3=>'砸蛋活动',4=>'双蛋领取',5=>'保险支付',6=>'赠送',7=>'易道用车补贴转化为代金券',8=>'“5.20”活动赠送',9=>'"乐满中秋"活动赠送',
        10=>'积分兑换',11=>'"国庆领券"活动赠送',12=>'活动赠送-APP',13=>'五一送券',14=>'暑期活动',15=>'双节活动'),
    'routetag' => array(
            '1' => '景点',
            '2' => '酒店',
            '3' => '用餐',
            '4' => '住宿',
            '5' => '其他',
            '6' => '自由活动',
        ),//线路详情 活动地点区分
    'photo' => array(1 => '景点',2 => '酒店', 3 => '餐饮'),
    'hongbao' => array(
        'iscash' => array(0 => '现金红包', 1 => '抵扣红包', 2=>'定向红包'),
        'sellerpaycategory' => array(1=>'现金支付', 2=>'银行转账', 3=>'网银支付'),
        'state' => array(0 => '未抵扣', 1 => '已抵扣', 2 => '未兑现', 3 => '已兑现'),
    ),
    'takecategory' => array(0 => '不限', 1 => '接送', 2 => '单接', 3 => '单送'),
    'traffic' => array(
        'trafficisback' => array(0 =>'不限',1 =>'往', 2 => '返', 3 => '往返'),
        'traffictype' => array(0 =>'飞机', 1 => '汽车', 2 => '火车', 3 => '高铁', 4 => '动车', 5 => '渡轮'),
    ), 

    'ucskin' => 'member.center.v1',    //用户中心页面目录
    'ucskinto' => 'member.center.v2',    //用户中心页面目录
    'indexskin' => array('tripb2b' =>'web.tripb2b.v3','happytoo' =>'web.happytoo.v3','mconline' =>'web.mconline.v2'),   //三网首页目录
    'weekday' => array('周日','周一','周二','周三','周四','周五','周六'),
     'siteids'=>array(
                'nanjingPaySiteIds' => [36],
                'xuzhouSiteIds' => [84],
                'qingdaoPaySiteIds' => [153],
                 'wulmuqiPaySiteIds' => [92],
                'yantaiPaySiteIds' => [207],
                'ningboPaySiteIds' => [25],
        ),
    'paybankinfo'=>array(
        '1'=>array(
            '36' => 0.03,//南京站
            '84' => 0.07,//徐州站
            '153' => 0.07,//青岛站
        ),
        '2'=>array(
            '36' => 0.03,//南京站
            '84' => 0.07,//徐州站
            '153' => 0.07,//青岛站
             '92' => 0.07,//乌鲁木齐站
             '207' => 0.07,//烟台站
             '25' => 0.07,//宁波站
        ),
        '4'=>array(
            '36' => 0.03,//南京站
            '84' => 0.07,//徐州站
            '153' => 0.07,//青岛站
        ),
    ),
    'holidaysite'=>array(
        '72' => '上海',
        '56' => '杭州',
        '77' => '济南',
        '173' => '南通',
        '153' => '青岛',
        '36' => '南京',
    ),
    'orderstatus'=>array(0 => '未确认', 1 => '已确认', 2 => '取消', 3 => '名单不全',4=>'已出票'),//订单状态
    'neworderstatus'=>array(0 => '待确认', 1 => '待支付', 2 => '已取消', 3 => '名单不全',4=>'已出票'),//订单状态

    'charge' => array(
		'id' => '1000000007',
		'account' => '100000000000007',
		'url' => 'http://112.95.172.89:7080/recvcdkey.php',
        //'url' => 'http://ceshi.007ka.cn/recvcdkey.php',
		'key' => 'I5oCbrolpr4=',
	),

    'ordersite' => array('tripb2b' =>1,'happytoo' =>2,'mconline' =>4),
    'paytype' => array('0'=>"支票",'1'=>"现金",'2'=>"电汇",'3'=>"其他",'11'=>"上门收款",'12'=>"对公汇款",'13'=>"对私汇款",'14'=>"现金支票",'15'=>"转账支票"),
    'promote' => array('153','84','92','207','25'), // 青岛、徐州线、乌鲁木齐、烟台、宁波路立减规则
    'defaultlogo' => array( //三个首页默认图片的路径
        'company' => 'images/default-company.jpg',
        'line' => 'images/default-line.jpg',
    ),
    'specialdest' => array('401','402','403'), //甘青宁 //华东 //东北
    'b2corderstatus'=>array(0 => '未确认', 1 => '已确认', 2 => '取消', 3 => '名单不全',4=>'已出票'),//订单状态
    
    'premiumtype' => array(0 => '境内旅游保险', 1 => '境外旅游保险', 2 => '航空保险', 3 => '交通工具保险', 4 => '签证保险'),//保险类型
    'premiumordertype' => array(0 => '待支付', 1 => '出保处理中', 2 => '已出保单', 3 => '已退保单', 4 => '已取消', 5 => '退保处理中', 6 => '名单信息不全'),//订单状态
    'policystatus' =>array(1=>'处理中', 2 =>'已出保单' , 3 =>'已退保单'),
    'website' => array(1 => '馨·驰誉', 2 => '馨·欢途', 4 => '美程'),
    'insurance' => "http://119.38.194.68/",
    'hotellevel' => array(0 => '经济型',1 => '三星/舒适',2 => '四星/高档', 3=>'五星/豪华',  4=> '五星/顶级'),
    'traffictool' => array(0 => '火车往返',1 => '汽车往返',2 => '飞机往返', 3=>'火车+汽车往返',4=>'飞机+汽车往返',5=>'船往返',6=>'汽车+船往返'),
     'insurancecompanytype'  => array(
        0 => '合众人寿',
	    1 => '平安保险',
        //2 => '美亚', 3 => '安盛', 4 => '太平洋人寿', 5 => '天安人寿', 6 => '史带',7 => '长生人寿',8 => '安联'
    ),

    'key' => 'fjrbbb4xk3w0cacccpvjo0yx866vaa3d',//支付回调加密码Key
    'baidu_stats' => array(
        'tripb2b' => '88425eaa269837e12ecbf2f7be95c9b1',
        'happytoo' => '83e4ff4400bbc68a913c87dbcc87db9d',
        'mconline' => 'eaca974e17de1e021febc6ee17fef36f',
    ),
    'charge' => array(
        'id' => '1000000007',
        'account' => '100000000000007',
        'url' => 'http://112.95.172.89:7080/recvcdkey.php',
        'key' => 'I5oCbrolpr4=',
    ),
    'alipay'=>array(
        'companyid'=>array(95249,87103,71031,102783,28168,305692),
        'istranss'=>1
    ),
);